{
  __meta__: {
    author: 'catalin',
    source: 'https://github.com/enkidevs/curriculum/blob/master/javascript/react/intro-react/what-i-need-to-use-react.md',
  },
  type: 'choose_sequence',
  lang: 'en',
  tags: [
    'enki',
    'must-know',
  ],
  card: {
    question: '<p>Which tool will automatically set-up the development environment for a simple <code>React</code> <strong>SPA</strong>?</p>\n<p>???</p>\n',
    answers: [
      {
        text: 'create-react-app',
      },
      {
        text: 'react-dom',
      },
      {
        text: 'browserify',
      },
      {
        text: 'babel-preset-react',
      },
    ],
    comment: '<p>Being a truly flexible library, you can create applications from scratch with <strong>React</strong>, but also gradually including it to your code base without having to re-write anything.</p>\n<p>To install <strong>React</strong> you can use a <em>package manager</em> such as <code>yarn</code> or <code>npm</code>:</p>\n<pre><code class="language-bash">// yarn\n$ yarn add react react-dom\n// npm\n$ npm install --save react react-dom\n</code></pre>\n<p>You can also use a <strong>CDN</strong> (Content Delivery Network). For both the development and production builds (<em>minified</em>) check the link appended to the insight.</p>\n<p>The former option is advised because it gives you access to a vast ecosystem of <em>third-party libraries</em> that can be easily installed and integrated.</p>\n<p>Although not required, adopting a modern <strong>build pipeline</strong> is highly recommended to boost productivity and efficiency. Apart from the <em>package manager</em>, this includes:</p>\n<ul>\n<li>a <strong>bundler</strong>[1] such as <code>webpack</code> or <code>browserify</code> to improve load time by modularising your code</li>\n<li>a <strong>compiler</strong> such as <code>Babel</code>[2]</li>\n</ul>\n<p>Using <code>Babel</code> compiler will allow you to write your application with both <code>ES6</code>[3] and <code>JSX</code> syntax. For this, you need to install <code>babel-preset-react</code> and <code>babel-preset-es2015</code> and enable them in your <code>.babelrc</code> config file.</p>\n<p>To create a <strong>Single page application</strong> you can use the officially supported package called <code>create-react-app</code>:</p>\n<pre><code class="language-bash">$ npm i -g create-react-app\n$ create-react-app myAppName\n</code></pre>\n<p>This will automatically create a <em>static application</em> with no backend logic or databases. However, this will set-up the development environment including all the modern tools specified above.</p>\n<p>To run your <code>create-react-app</code> app just:</p>\n<pre><code class="language-bash">$ cd myAppName\n$ npm start\n</code></pre>\n',
  },
}